<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2016 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

return [
    // 数据库类型
    'type'            => 'pgsql',
    // 服务器地址
//    'hostname'        => '39.108.147.60',
    'hostname'        => '10.192.1.162',
    // 数据库名
    'database'        => 'fyjc_db',
    // 用户名
    'username'        => 'postgres',
    // 密码
//    'password'        => 'Fubo@801',
    'password'        => 'fydb123',
    // 端口
    'hostport'        => '5432',
    // 数据库表前缀
    'prefix'          => 'fyjc_',
    // 数据库部署方式:0 集中式(单一服务器),1 分布式(主从服务器)
    'deploy'          => 0,
    // 数据库读写是否分离 主从式有效
    'rw_separate'     => false,
    // 读写分离后 主服务器数量
    'master_num'      => 1,
];